---
kind: type
id: T:Autodesk.Revit.DB.TessellatedShapeBuilderResult
source: html/16e1e032-d9fd-2708-0704-ed00b0b85441.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilderResult

Describes what TessellatedShapeBuilder has
 construct.

## Syntax (C#)
```csharp
public class TessellatedShapeBuilderResult : IDisposable
```